app/controllers/store_controller.rb

INSERT INTO "line_items" ("order_id", "updated_at", "total_price", "product_id", "quantity", "created_at") VALUES(1, '2010-02-09 03:43:01', 29.95, 7, 1, '2010-02-09 03:43:01')
INSERT INTO "orders" ("name", "updated_at", "pay_type", "address", "email", "created_at") VALUES('Michel ', '2010-02-09 16:13:55', 'check', '110', 'ss', '2010-02-09 16:13:55')
---
  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save